---
type: StructuralSectionZProfile
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionZProfile

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionZProfile | 2016 | `public StructuralSectionZProfile ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double principalAxes` |